==================
Integer literal
==================
2
---

(source_file
  (expression
    (literal
      (number))))

==================
Scientific notation
==================
2e4
---

(source_file
  (expression
    (literal
      (number))))

==================
Scientific notation with decimal
==================
.2e-3
---

(source_file
  (expression
    (literal
      (number))))

==================
Float with trailing decimal
==================
2.e3
---

(source_file
  (expression
    (literal
      (number))))

==================
Imaginary unit
==================
ii
---

(source_file
  (expression
    (literal
      (number))))

==================
Negative float
==================

-.5

---

(source_file
      (expression
          (literal
            (number))))


==================
Float with trailing dot
==================

1.

---

(source_file
  (expression
    (literal
      (number))))

==================
String literal
==================

"Hello, World!"

---

(source_file
  (expression
    (literal
      (string))))

==================
String with escape sequence
==================
"Line1\nLine2"
---

(source_file
  (expression
    (literal
      (string
        (escape_sequence)))))

==================
String with escaped quote
==================

"Bracket\"Character"

---

(source_file
  (expression
    (literal
      (string
        (escape_sequence)))))

==================
Triple slash string
==================
/// no escape works \t\n \ "here" ///
---

(source_file
  (expression
    (literal
      (string))))

==================
Boolean literal
==================
true
---

(source_file
  (expression
    (literal
      (boolean))))

==================
Binary multiply and add
=================

2 * 3 + b

---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (binary_operator_expression
          left: (expression
            (literal
              (number)))
          right: (expression
            (literal
              (number)))))
      right: (expression
        (identifier)))))

==================
Right associative power
==================

a ^ b ^ c

---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (identifier))
      right: (expression
        (binary_operator_expression
          left: (expression
            (identifier))
          right: (expression
            (identifier)))))))

==================
Complex precedence
==================

a + b * c ^ d

---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (identifier))
      right: (expression
        (binary_operator_expression
          left: (expression
            (identifier))
          right: (expression
            (binary_operator_expression
              left: (expression
                (identifier))
              right: (expression
                (identifier)))))))))

==================
Left associative addition
==================
a + c + c
---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (binary_operator_expression
          left: (expression
            (identifier))
          right: (expression
            (identifier))))
      right: (expression
        (identifier)))))

==================
Factorial and parentheses
==================
(a * b!)! + c!
---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (postfix_unary_operator_expression
          (expression
            (parenthesized_expression
              (expression
                (binary_operator_expression
                  left: (expression
                    (identifier))
                  right: (expression
                    (postfix_unary_operator_expression
                      (expression
                        (identifier))))))))))
      right: (expression
        (postfix_unary_operator_expression
          (expression
            (identifier)))))))

==================
Right associative assignment
==================
a = b = c
---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (identifier))
      right: (expression
        (binary_operator_expression
          left: (expression
            (identifier))
          right: (expression
            (identifier)))))))

==================
Postfix graded operator
==================
.3 (*)
---

(source_file
  (expression
    (postfix_unary_operator_expression
      (expression
        (literal
          (number))))))

==================
Array with empty slots
==================
[a, b,,,]
---

(source_file
  (expression
    (array
      content: (expression
        (identifier))
      content: (expression
        (identifier)))))

==================
Empty sequence
==================
()
---

(source_file
  (expression
    (sequence)))

==================
Parenthesized expression
==================
(a)
---

(source_file
  (expression
    (parenthesized_expression
      (expression
        (identifier)))))

==================
Sequence with only separator
==================
(,)
---

(source_file
  (expression
    (sequence)))

==================
Sequence with trailing commas
==================
(a,,)
---

(source_file
  (expression
    (sequence
      content: (expression
        (identifier)))))

==================
Array with leading empty slots
==================
[,,a,b,]
---

(source_file
  (expression
    (array
      content: (expression
        (identifier))
      content: (expression
        (identifier)))))

==================
Single element array
==================
[b]
---

(source_file
  (expression
    (array
      content: (expression
        (identifier)))))

==================
List with mixed content
==================
{a,,1.,.4}
---

(source_file
  (expression
    (list
      content: (expression
        (identifier))
      content: (expression
        (literal
          (number)))
      content: (expression
        (literal
          (number))))))

==================
Comment line
==================

-- This is a comment
x

---

(source_file
  (expression
    (identifier)))

==================
Block comment
==================

-* This is a 
   block comment *-
y

---

(source_file
  (expression
    (identifier)))

==================
Multiple operators
==================

a and b or c

---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (binary_operator_expression
          left: (expression
            (identifier))
          right: (expression
            (identifier))))
      right: (expression
        (identifier)))))

==================
Comparison operators
==================

a < b == c

---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (binary_operator_expression
          left: (expression
            (identifier))
          right: (expression
            (identifier))))
      right: (expression
        (identifier)))))

==================
Member access
==================

a.b

---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (identifier))
      right: (expression
        (identifier)))))

==================
Subscript operator
==================

a#b

---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (identifier))
      right: (expression
        (identifier)))))

==================
Composition operator
==================

f @@ g

---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (identifier))
      right: (expression
        (identifier)))))

==================
Tensor product
==================

a ** b

---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (identifier))
      right: (expression
        (identifier)))))

==================
Range operators
==================

1 .. 10

---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (literal
          (number
            (unsigned_int))))
      right: (expression
        (literal
          (number))))))

==================
Application (space-separated)
==================

f x

---

(source_file
  (expression
    (binary_operator_expression
      function: (expression
        (identifier))
      argument: (expression
        (identifier)))))

==================
Prefix not operator
==================

not x

---

(source_file
  (expression
    (prefix_operator_expression
      expression: (expression
        (identifier)))))

==================
Prefix length operator
==================

#x

---

(source_file
  (expression
    (prefix_operator_expression
      expression: (expression
        (identifier)))))

==================
Postfix tilde operator
==================

x~

---

(source_file
  (expression
    (postfix_operator_expression
      (expression
        (identifier)))))

==================
Arrow assignment
==================

f := x -> x + 1

---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (identifier))
      right: (expression
        (binary_operator_expression
          left: (expression
            (identifier))
          right: (expression
            (binary_operator_expression
              left: (expression
                (identifier))
              right: (expression
                (literal
                  (number))))))))))

==================
Complex nested expression
==================

(a + b) * (c - d)

---

(source_file
  (expression
    (binary_operator_expression
      left: (expression
        (parenthesized_expression
          (expression
            (binary_operator_expression
              left: (expression
                (identifier))
              right: (expression
                (identifier))))))
      right: (expression
        (parenthesized_expression
          (expression
            (binary_operator_expression
              left: (expression
                (identifier))
              right: (expression
                (identifier)))))))))


